experiments/wrk2/wrk2-17/out.txt
Running 2m test @ http://192.168.1.2
  8 threads and 100 connections
  Thread calibration: mean lat.: 1636.527ms, rate sampling interval: 5812ms
  Thread calibration: mean lat.: 1557.717ms, rate sampling interval: 5541ms
  Thread calibration: mean lat.: 1583.285ms, rate sampling interval: 5578ms
  Thread calibration: mean lat.: 1577.945ms, rate sampling interval: 5631ms
  Thread calibration: mean lat.: 1598.880ms, rate sampling interval: 5648ms
  Thread calibration: mean lat.: 1650.169ms, rate sampling interval: 5836ms
  Thread calibration: mean lat.: 1597.682ms, rate sampling interval: 5615ms
  Thread calibration: mean lat.: 1629.002ms, rate sampling interval: 5775ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.21s     9.90s   38.86s    57.76%
    Req/Sec    22.03k   214.62    22.74k    74.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.19s 
 75.000%   28.80s 
 90.000%   33.98s 
 99.000%   37.16s 
 99.900%   37.85s 
 99.990%   38.54s 
 99.999%   38.83s 
100.000%   38.90s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2897.919     0.000000           17         1.00
    6541.311     0.100000      1938453         1.11
    9928.703     0.200000      3876347         1.25
   13336.575     0.300000      5812390         1.43
   16752.639     0.400000      7749118         1.67
   20185.087     0.500000      9691832         2.00
   21889.023     0.550000     10662337         2.22
   23592.959     0.600000     11630862         2.50
   25329.663     0.650000     12598887         2.86
   27066.367     0.700000     13567288         3.33
   28803.071     0.750000     14535626         4.00
   29671.423     0.775000     15020419         4.44
   30523.391     0.800000     15499958         5.00
   31375.359     0.825000     15983353         5.71
   32243.711     0.850000     16469637         6.67
   33112.063     0.875000     16956895         8.00
   33538.047     0.887500     17197019         8.89
   33980.415     0.900000     17447701        10.00
   34406.399     0.912500     17687760        11.43
   34832.383     0.925000     17933498        13.33
   35258.367     0.937500     18171214        16.00
   35487.743     0.943750     18300122        17.78
   35684.351     0.950000     18408109        20.00
   35913.727     0.956250     18534870        22.86
   36143.103     0.962500     18662710        26.67
   36339.711     0.968750     18768733        32.00
   36470.783     0.971875     18843402        35.56
   36569.087     0.975000     18897243        40.00
   36667.391     0.978125     18951716        45.71
   36798.463     0.981250     19017704        53.33
   36929.535     0.984375     19082409        64.00
   36995.071     0.985938     19113405        71.11
   37060.607     0.987500     19143629        80.00
   37126.143     0.989062     19172354        91.43
   37191.679     0.990625     19198206       106.67
   37257.215     0.992188     19225851       128.00
   37289.983     0.992969     19238060       142.22
   37355.519     0.993750     19258695       160.00
   37388.287     0.994531     19268678       182.86
   37453.823     0.995313     19286094       213.33
   37519.359     0.996094     19301237       256.00
   37552.127     0.996484     19308573       284.44
   37584.895     0.996875     19314960       320.00
   37617.663     0.997266     19321503       365.71
   37683.199     0.997656     19332299       426.67
   37715.967     0.998047     19337173       512.00
   37748.735     0.998242     19342105       568.89
   37781.503     0.998437     19347075       640.00
   37781.503     0.998633     19347075       731.43
   37814.271     0.998828     19351756       853.33
   37847.039     0.999023     19354707      1024.00
   37879.807     0.999121     19356361      1137.78
   37912.575     0.999219     19358028      1280.00
   37945.343     0.999316     19359701      1462.86
   37978.111     0.999414     19361541      1706.67
   38043.647     0.999512     19364266      2048.00
   38043.647     0.999561     19364266      2275.56
   38076.415     0.999609     19365323      2560.00
   38141.951     0.999658     19367394      2925.71
   38141.951     0.999707     19367394      3413.33
   38174.719     0.999756     19368311      4096.00
   38207.487     0.999780     19368836      4551.11
   38240.255     0.999805     19368995      5120.00
   38338.559     0.999829     19369414      5851.43
   38436.863     0.999854     19370142      6826.67
   38469.631     0.999878     19370616      8192.00
   38469.631     0.999890     19370616      9102.22
   38535.167     0.999902     19370993     10240.00
   38567.935     0.999915     19371179     11702.86
   38633.471     0.999927     19371481     13653.33
   38666.239     0.999939     19371646     16384.00
   38699.007     0.999945     19371867     18204.44
   38699.007     0.999951     19371867     20480.00
   38731.775     0.999957     19372041     23405.71
   38731.775     0.999963     19372041     27306.67
   38764.543     0.999969     19372195     32768.00
   38764.543     0.999973     19372195     36408.89
   38797.311     0.999976     19372434     40960.00
   38797.311     0.999979     19372434     46811.43
   38797.311     0.999982     19372434     54613.33
   38797.311     0.999985     19372434     65536.00
   38830.079     0.999986     19372581     72817.78
   38830.079     0.999988     19372581     81920.00
   38830.079     0.999989     19372581     93622.86
   38830.079     0.999991     19372581    109226.67
   38830.079     0.999992     19372581    131072.00
   38862.847     0.999993     19372710    145635.56
   38862.847     0.999994     19372710    163840.00
   38862.847     0.999995     19372710    187245.71
   38862.847     0.999995     19372710    218453.33
   38862.847     0.999996     19372710    262144.00
   38862.847     0.999997     19372710    291271.11
   38862.847     0.999997     19372710    327680.00
   38862.847     0.999997     19372710    374491.43
   38862.847     0.999998     19372710    436906.67
   38862.847     0.999998     19372710    524288.00
   38862.847     0.999998     19372710    582542.22
   38862.847     0.999998     19372710    655360.00
   38862.847     0.999999     19372710    748982.86
   38862.847     0.999999     19372710    873813.33
   38862.847     0.999999     19372710   1048576.00
   38862.847     0.999999     19372710   1165084.44
   38862.847     0.999999     19372710   1310720.00
   38895.615     0.999999     19372723   1497965.71
   38895.615     1.000000     19372723          inf
#[Mean    =    20212.838, StdDeviation   =     9901.805]
#[Max     =    38862.848, Total count    =     19372723]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  473.00us
 75.000%  664.00us
 90.000%  740.00us
 99.000%    1.13ms
 99.900%    1.47ms
 99.990%    5.06ms
 99.999%   12.04ms
100.000%   19.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.071     0.000000            1         1.00
       0.317     0.100000      1948478         1.11
       0.424     0.200000      3878165         1.25
       0.443     0.300000      5924630         1.43
       0.457     0.400000      7806892         1.67
       0.473     0.500000      9734703         2.00
       0.484     0.550000     10719487         2.22
       0.500     0.600000     11656144         2.50
       0.541     0.650000     12595673         2.86
       0.639     0.700000     13579379         3.33
       0.664     0.750000     14565113         4.00
       0.673     0.775000     15016404         4.44
       0.683     0.800000     15528715         5.00
       0.693     0.825000     16019488         5.71
       0.704     0.850000     16496299         6.67
       0.718     0.875000     16975350         8.00
       0.727     0.887500     17206955         8.89
       0.740     0.900000     17447407        10.00
       0.762     0.912500     17679132        11.43
       0.833     0.925000     17921721        13.33
       0.876     0.937500     18162482        16.00
       0.890     0.943750     18289762        17.78
       0.902     0.950000     18410216        20.00
       0.914     0.956250     18531438        22.86
       0.927     0.962500     18653220        26.67
       0.942     0.968750     18772391        32.00
       0.951     0.971875     18830618        35.56
       0.963     0.975000     18892865        40.00
       0.978     0.978125     18949275        45.71
       1.007     0.981250     19010649        53.33
       1.067     0.984375     19070618        64.00
       1.091     0.985938     19101201        71.11
       1.109     0.987500     19130645        80.00
       1.126     0.989062     19161934        91.43
       1.142     0.990625     19191941       106.67
       1.159     0.992188     19221585       128.00
       1.169     0.992969     19236719       142.22
       1.181     0.993750     19252319       160.00
       1.195     0.994531     19267148       182.86
       1.214     0.995313     19282032       213.33
       1.248     0.996094     19297321       256.00
       1.274     0.996484     19304624       284.44
       1.304     0.996875     19312399       320.00
       1.329     0.997266     19320031       365.71
       1.351     0.997656     19327389       426.67
       1.374     0.998047     19335023       512.00
       1.386     0.998242     19338675       568.89
       1.400     0.998437     19342504       640.00
       1.417     0.998633     19346352       731.43
       1.439     0.998828     19350059       853.33
       1.477     0.999023     19353856      1024.00
       1.507     0.999121     19355740      1137.78
       1.544     0.999219     19357634      1280.00
       1.583     0.999316     19359489      1462.86
       1.629     0.999414     19361374      1706.67
       1.712     0.999512     19363276      2048.00
       1.836     0.999561     19364210      2275.56
       2.111     0.999609     19365160      2560.00
       2.739     0.999658     19366104      2925.71
       3.509     0.999707     19367050      3413.33
       4.223     0.999756     19368002      4096.00
       4.367     0.999780     19368471      4551.11
       4.467     0.999805     19368943      5120.00
       4.575     0.999829     19369426      5851.43
       4.699     0.999854     19369889      6826.67
       4.851     0.999878     19370361      8192.00
       4.959     0.999890     19370596      9102.22
       5.095     0.999902     19370839     10240.00
       5.307     0.999915     19371072     11702.86
       5.651     0.999927     19371305     13653.33
       6.307     0.999939     19371541     16384.00
       6.939     0.999945     19371661     18204.44
       7.223     0.999951     19371780     20480.00
       7.687     0.999957     19371896     23405.71
       8.263     0.999963     19372014     27306.67
       8.447     0.999969     19372134     32768.00
       8.551     0.999973     19372193     36408.89
       8.687     0.999976     19372251     40960.00
       9.015     0.999979     19372310     46811.43
       9.519     0.999982     19372369     54613.33
      10.543     0.999985     19372428     65536.00
      10.879     0.999986     19372458     72817.78
      11.287     0.999988     19372487     81920.00
      11.911     0.999989     19372517     93622.86
      12.319     0.999991     19372546    109226.67
      12.679     0.999992     19372576    131072.00
      13.023     0.999993     19372590    145635.56
      13.255     0.999994     19372605    163840.00
      13.799     0.999995     19372620    187245.71
      14.151     0.999995     19372635    218453.33
      15.039     0.999996     19372650    262144.00
      15.351     0.999997     19372657    291271.11
      15.551     0.999997     19372664    327680.00
      15.791     0.999997     19372672    374491.43
      15.999     0.999998     19372679    436906.67
      16.247     0.999998     19372687    524288.00
      16.255     0.999998     19372690    582542.22
      16.271     0.999998     19372695    655360.00
      16.295     0.999999     19372698    748982.86
      16.359     0.999999     19372702    873813.33
      16.479     0.999999     19372705   1048576.00
      16.607     0.999999     19372707   1165084.44
      16.703     0.999999     19372710   1310720.00
      16.735     0.999999     19372712   1497965.71
      16.735     0.999999     19372712   1747626.67
      17.551     1.000000     19372714   2097152.00
      17.647     1.000000     19372715   2330168.89
      17.871     1.000000     19372716   2621440.00
      18.063     1.000000     19372717   2995931.43
      18.159     1.000000     19372718   3495253.33
      18.239     1.000000     19372719   4194304.00
      18.239     1.000000     19372719   4660337.78
      18.607     1.000000     19372720   5242880.00
      18.607     1.000000     19372720   5991862.86
      19.679     1.000000     19372721   6990506.67
      19.679     1.000000     19372721   8388608.00
      19.679     1.000000     19372721   9320675.55
      19.759     1.000000     19372722  10485760.00
      19.759     1.000000     19372722  11983725.71
      19.759     1.000000     19372722  13981013.34
      19.759     1.000000     19372722  16777216.00
      19.759     1.000000     19372722  18641351.10
      19.823     1.000000     19372723  20971519.98
      19.823     1.000000     19372723          inf
#[Mean    =        0.537, StdDeviation   =        0.208]
#[Max     =       19.808, Total count    =     19372723]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  21135576 requests in 2.00m, 16.91GB read
Requests/sec: 176131.33
Transfer/sec:    144.28MB